Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AreEqualTo(Autodesk.Revit.DB.ICustomFieldProperties)
Identifies if the custom field properties are equal or not.
otherProperties:
The other properties.
Returns:
Returns true if the custom field properties are equal, false otherwise.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.ValidateProperties(Autodesk.Revit.DB.ViewSchedule)
A validation is done, and if there are any errors a string indicating the error will be returned.
If the properties are valid, a
schedule:
The schedule that contains this field whose properties are tested.
Returns:
Returns a string which describes which data are incorrect.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsForSegmentsEnabled
Identifies if radial or diameter dimensions will be shown for the bends between segments.
Radial or diameter dimesions for arc segments will be shown by default.
This property has a menaning only if Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsEnabled is set to true.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsForHooksEnabled
Identifies if radial or diameter dimensions will be shown for hook fillets
This property has a meaning only if Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsEnabled is set to true.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionType
Identifies what type of bend diameter dimensions will be shown (radial or diameter).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsEnabled
Identifies if any radial or diameter dimensions will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.DiameterDimensionTypeId
Identifies the Id of the diameter dimension type which is used to show dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The diameterDimensionTypeId should be an id of a diameter dimension type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.RadialDimensionTypeId
Identifies the Id of the radial dimension type which is used to show dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The radialDimensionTypeId should be an id of a radial dimension type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsMeasurementOptions
Identifies the measurement option for angular dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsOffset
Identifies the offset of the angular dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for angularDimensionsOffset must be between 0 and 30000 feet.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsForHooksEnabled
Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsDisplayOption
Identifies the angular dimensions display options.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionTextPosition
Identifies the text position with respect to dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsEnabled
Identifies if any angular dimensions will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionTypeId
Identifies the Id of the angular dimension type which is used to show dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The angularDimensionTypeId should be an id of an angular dimension type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.OrthogonalAndOverallDimesionsEnabled
Identifies if orthogonal and overall dimensions are displayed.
Remarks:
Orthogonal segment length dimensions are dimensions defining the slope of a bar segment.
Overall dimensions are dimensions that spans over multiple segments.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthsForArcsDisplayOption
Identifies if the arc segment lengths are represented using dimensions or just as text.
Only RebarShapes whose definition is RebarShapeDefinitionByArc are considered that have arc segments.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthsDisplayOption
Identifies if the segment lengths are represented using dimensions or just as text.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionTextPosition
Identifies the text position with respect to dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsOffset
Identifies the offset of the segment length dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for segmentLengthDimensionsOffset must be between 0 and 30000 feet.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsForHooksEnabled
Identifies if segment length dimensions for hooks will be shown or not.
If this property is true, the Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsEnabled
Identifies if any segment length dimensions will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionTypeId
Identifies the Id of the linear dimension type which is used to show segments length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The segmentLengthDimensionTypeId should be an id of a linear dimension type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.MultipleValuesIndicatorOption
Identifies how the Bending Detail will represent the varying rebar dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.RepresentaionOf3DShapes
Identifies how the Bending Detail will represent the 3D shapes.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentsRepresentation
Identifies how the bending detail will represent the segments of the bar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.ParametersDisplayOption
Identifies how the parameters will be represented.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.LineStyleId
Identifies the line style that is used for drawing Bending Detail curves.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The lineStyleId should be an id of a line style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.#ctor(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties
Represents the properties of a Bending Detail Custom Field.
Since:
2024